const { Bot, Keyboard } = require("@maxhub/max-bot-api");
require("dotenv").config();

const bot = new Bot(process.env.BOT_TOKEN);

bot.api.setMyCommands([
  {
    name: "start",
    description: "Начать",
  },
]);

console.log(Object.keys(Keyboard.button));

const keyboard = Keyboard.inlineKeyboard([
  [
    Keyboard.button.link(
      "🚀 Открыть мини-приложение",
      "https://max.ru/t29_hakaton_bot?startapp"
    ),
  ],
]);

bot.command("start", (ctx) => {
  const text = `🎓 Привет! Я — MAX, ваш виртуальный помощник университета.

Я помогу вам:
💡 узнать информацию о приёме и поступлении;
📅 разобраться в расписании занятий и экзаменов;
📚 получить сведения о факультетах, кафедрах и преподавателях;
🏛️ найти нужные службы и подразделения университета;
❓ и просто ответить на любые вопросы о студенческой жизни!

Напишите, что вас интересует, — и я подскажу 😊`;

  return ctx.reply(text, { attachments: [keyboard] });
});

bot.start();
